#pragma once

using namespace std;

#include <iostream>
#include <fstream>

/*Лабораторная работа 9.

Тема. Работа с текстовым файлом.
Требования и общие указания к заданиям.
Необходимо разработать и проверить функции для реализации следующих действий с текстовым файлом:
    • создание файла;
    • просмотр файла, т. е. вывод его содержимого на экран; 
    • добавление текста в файл;
    • реализация функциональной части, указанной в варианте, и запись полученного результата во второй текстовый файл.
При этом можно работать с текстовым файлом как посимвольно, так и построчно на усмотрение преподавателя или студента. В качестве дополнительного задания (например, если кроме лабораторных работ есть вычислительная практика) можно запрограммировать и второй вариант. 
Проанализировать баланс скобок при условии, что они используются только для объединения нескольких простых операторов в один блок 

*/



