#pragma once


/*
Лабораторная работа 2.

Тема. Работа со строками.
Требования и общие указания к заданиям.
Обрабатываемый в программе текст должен содержать несколько строк. 
Но массив строк не формировать, то есть в оперативной памяти хранить одну обрабатываемую строку. 
Оперативную память резервируем для одной строки. Вводим строку, анализируем её и на её место вводим новую строку (см. пример 3). 
В задачах выделения и анализа слов возможны следующие уровни сложности задач: 
        ◦ первый, самый простой уровень, предполагает, что слова разделены одним пробелом (6 баллов); 
        ◦ задачи незначительно усложняются, если предположить, 
        что между словами может быть несколько пробелов (7 баллов);
        ◦ в задачах следующего уровня предполагается, что между словами может быть любое количество 
        не обязательно одинаковых разделителей. Например, слова могут быть разделены тремя точками (многоточием), 
        после которых следует пробел; или скобкой, запятой и пробелом, как это имеет место в нашем предложении и т. п. (9 баллов);
        ◦ и, наконец, алгоритм и программа ещё более усложняются, если предположить, что слова могут переноситься с одной 
        строки текста на другую строку (10 баллов).
В скобках указано наибольшее количество баллов, на которое можно оценить своевременно выполненное задание среднего уровня сложности (B), 
в зависимости от требований к тексту.
Предусмотреть цветной вывод исходного или преобразованного текста. Например, в задаче B10 слова максимальной длины вывести другим цветом. 
Cложность задач и их оценка зависят также от того, учитывать то, что записано в квадратных скобках условия задачи или нет. 
Рекомендуется вначале написать и отладить программу для более простого условия, а затем её усложнить.*/

